const fakeData = [
  {
    name: "شرح كتاب بلوغ المرام",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب رياض الصالحين الفصل السابع الدرس الخامس عشر من كتاب رياض الصالحين",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب عنوان حجمه اصغر اصغر شوية شوية شوية",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 4",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 5",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 6",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 7",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 8",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 9",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 10",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 11",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 12",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 13",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 14",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 15",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 16",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 17",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 18",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 19",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
  {
    name: "شرح كتاب 20",
    data: "23-2-2023",
    numbers: "43",
    image: "/images/book1.jpg",
    link: "https://drosuae.com/Download/shk_3azez_far7an/radio%26tv/sareatu_al_nur/2023_1_29_793.mp3",
    speech:
      "الفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدينالفتوى رقم 1 :المسلم عليه واجبات كثيرة فكيف يتعامل معها لكي يحصل على الأجور العظيمة وينجو من عقوبة الله تعالى؟ الجواب: المسلم الموفق يؤدي كل ما أوجبه الله عليه ويجتنب كل ماحرم الله عليه فيكون من المقتصدين",
  },
];

// ---------data and pagination----------
const dataContainer = document.querySelector("#dataContainer");
const prevBtn = document.querySelector("#prev");
const nextBtn = document.querySelector("#next");
const pageNumbersContainer = document.querySelector("#pageNumbers");

let currentPage = 1;
const itemsPerPage = 6;

function renderData() {
  dataContainer.innerHTML = "";

  const startIndex = (currentPage - 1) * itemsPerPage;
  const endIndex = startIndex + itemsPerPage;
  const pageData = fakeData.slice(startIndex, endIndex);

  pageData.forEach((item) => {
    const objectInfo = document.createElement("div");
    objectInfo.classList.add("articles-items", "flex");
    let first200Letters = item.speech.slice(0, 200);
    objectInfo.innerHTML = `

    <div class="articles-item flex-column">
    <a href="/writtenSpeech.html" class="link-title">
    <h4 class="card-content-title">${item.name}</h4>
    </a>
    <div class="card-content-info flex">
      <p>مرئيات منوعة</p>
      <p>31-1-1433</p>
    </div>
    <p class="card-content-article">
     ${first200Letters}.....
    </p>
    </div>

    `;

    dataContainer.appendChild(objectInfo);
  });

  renderPageNumbers();
}

function renderPageNumbers() {
  pageNumbersContainer.innerHTML = "";

  for (let i = Math.ceil(fakeData.length / itemsPerPage); i >= 1; i--) {
    const pageNumber = document.createElement("span");
    pageNumber.innerText = i;
    pageNumber.style.cursor = "pointer";
    pageNumber.style.margin = "0 10px";

    if (i === currentPage) {
      pageNumber.classList.add("active-page-number");
    }

    pageNumber.addEventListener("click", () => {
      currentPage = i;
      window.scrollTo(0, 0);
      renderData();
    });

    pageNumbersContainer.appendChild(pageNumber);
  }

  prevBtn.style.display = currentPage === 1 ? "none" : "block";
  nextBtn.style.display =
    currentPage === Math.ceil(fakeData.length / itemsPerPage)
      ? "none"
      : "block";
}

prevBtn.addEventListener("click", () => {
  currentPage--;
  window.scrollTo(0, 0);
  renderData();
});

nextBtn.addEventListener("click", () => {
  currentPage++;
  window.scrollTo(0, 0);
  renderData();
});

renderData();
